function nameRplc($elmt, $idx, $scds){
    
    let ltrArr =  ['ض', '٢', '٣', 'ء', 'ق', 'ع', 'أ', '١', 'ش', '٤', 'ك', 'ج', 'ث', 'ئ', '٥',
                   'آ', 'ط', 'ص', 'د', 'ن', 'ه', '٤', 'ر', '٧', 'ذ', 'ف', 'م', '٦', 'ٱ', 'غ', 'و',
                   'ا', 'ظ', 'ل', '٣', 'ز', '٦', '٠', '١', 'ش', '٤', 'ك', 'ج', 'ث', 'ئ', '٥', 'ض',
                   'ض', '٢', '٣', 'ء', 'ق', 'ع', 'أ', '١', 'ش', '٤', 'ك', 'ج', 'ث', 'ئ', '٥',
                   'آ', 'ط', 'ص', 'د', 'ن', 'ه', '٤', 'ر', '٧', 'ذ', 'ف', 'م', '٦', 'ٱ', 'غ', 'و',
                   'ا', 'ظ', 'ل', '٣', 'ز', '٦', '٠', '١', 'ش', '٤', 'ك', 'ج', 'ث', 'ئ', '٥', 'ض',
                   'ض', '٢', '٣', 'ء', 'ق', 'ع', 'أ', '١', 'ش', '٤', 'ك', 'ج', 'ث', 'ئ', '٥',
                   'آ', 'ط', 'ص', 'د', 'ن', 'ه', '٤', 'ر', '٧', 'ذ', 'ف', 'م', '٦', 'ٱ', 'غ', 'و',
                   'ا', 'ظ', 'ل', '٣', 'ز', '٦', '٠', '١', 'ش', '٤', 'ك', 'ج', 'ث', 'ئ', '٥', 'ض',
                   'ض', '٢', '٣', 'ء', 'ق', 'ع', 'أ', '١', 'ش', '٤', 'ك', 'ج', 'ث', 'ئ', '٥',
                   'آ', 'ط', 'ص', 'د', 'ن', 'ه', '٤', 'ر', '٧', 'ذ', 'ف', 'م', '٦', 'ٱ', 'غ', 'و',
                   'ا', 'ظ', 'ل', '٣', 'ز', '٦', '٠', '١', 'ش', '٤', 'ك', 'ج', 'ث', 'ئ', '٥', 'ض'];


    // for (let i = $idx; i < ltrArr.length; i++){
    //     setTimeout( () => { $elmt.innerHTML=ltrArr[i]; }, $scds);
    //     console.log(ltrArr[i]);
    // }
    
    // let i = $idx;
    // while (i < ltrArr.length){
    //     setTimeout( () => { $elmt.innerHTML=ltrArr[i]; }, $scds);
    //     i++;
    // }

}
 
let f1 = document.querySelector('#f1');
nameRplc(f1, 9, 1000);